Revit 2027 API
AnalysisDisplayStyle.SetLegendSettings Method
 Set legend settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLegendSettings(
	AnalysisDisplayLegendSettings legendSettings
)
Public Sub SetLegendSettings (
	legendSettings As AnalysisDisplayLegendSettings
)
public:
void SetLegendSettings(
	AnalysisDisplayLegendSettings^ legendSettings
)
member SetLegendSettings :
        legendSettings : AnalysisDisplayLegendSettings -> unit
Parameters
legendSettings AnalysisDisplayLegendSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace